# Написать функцию перевода десятичного числа в двоичное и обратно, без использования функции int
def dec2bin(a):
    return (print(f"{a:b}")), (print(a))


dec2bin(38)
