# Напишите функцию для кодирования текстового сообщения в соответствии с кодом Морзе
def transform2morze():
    morze = {
        "A": ".-", "B": "-...", "C": "-.-.", "D": "-..",
        "E": ".", "F": "..-.", "G": "--.", "H": "....",
        "I": "..", "J": ".---", "K": "-.-", "M": ".-..",
        "L": "--", "N": "-.", "O": "---", "P": ".--.",
        "Q": "--.-", "R": ".-.", "S": "...", "T": "-",
        "U": "..-", "V": "...-", "W": ".--", "X": "-..-",
        "Y": "-.--", "Z": "--..", "0": "-----", "1": ".----",
        "2": "..---", "3": "...--", "4": "....-", "5": ".....",
        "6": "-....", "7": "--...", "8": "---..", "9": "----.",
    }
    text = input("Enter the text you want to recode: ").upper().split()
    for word in text:
        print(" ".join([morze[key] for key in word]))


transform2morze()
