# 2.1.	 Составить программу:
# а)вычисления значения функции y = 17x2 – 6x + 13 при любом значении x;
# x = int(input())
# y = 17 * x**2 - 6 * x + 13
# print(y)
# б)вычисления значения функции y = 3a2 + 5a – 21 при любом значении а.
# a = int(input())
# y = 3 * a**2 + 5 * a - 21
# print(y)
# 2.2.	 Составить программу вычисления значения функции
#  при любом значении а.
# a = int(input())
# y = (a**2 + 10) / ((a**2 + 1)**0.5)
# print(round(y, 2))
# 2.3.	 Составить программу:
# а)  вычисления значения функции при любом
# значении а;
# from math import sin
# a = int(input())
# y = ((2 * a + sin(abs(3 * a))) / 3.56)**0.5
# print(round(y, 2))
# б)  вычисления значения функции при любом
# значении х
# x = int(input())
# y = sin((3.2 + (1 + x)**0.5) / abs(5 * x))
# print(round(y, 2))
# 2.4.	 Дана сторона квадрата. Найти его периметр.
# a = 10
# p = a * 4
# # 2.5.	 Дан радиус окружности. Найти ее диаметр
# r = 2
# d = (2 * r)
